import re
from collections import Counter

# Задача 2. Дан список повторяющихся элементов.
# Вернуть список с дублирующимися элементами. В результирующем списке не должно быть дубликатов

start_list = [1, 2, 1, 3, 'yes', 'no', 'yes', 'no', 'yes', 'no', '']
result_list = list(set(i for i in start_list if start_list.count(i) > 1))
print(result_list)

# Задача 3. В большой текстовой строке подсчитать количество встречаемых слов и вернуть 10 самых частых.
# Не учитывать знаки препинания и регистр символов.
# За основу возьмите любую статью из википедии или из документации к языку.

string = ('В декабре 1603 года султаном стал старший единокровный брат Мустафы Ахмед I. '
          'Сам Мустафа должен был быть казнён по закону Фатиха, однако по ряду причин '
          '(в частности, учитывая его психическое состояние) ему сохранили жизнь. '
          'Когда в ноябре 1617 года неожиданно умер Ахмед I, встал вопрос, кто унаследует трон: '
          'брат почившего султана Мустафа или его малолетний сын Осман. '
          'Чаша весов склонилась в сторону Мустафы и 22 ноября 1617 года его возвели на престол. '
          'Поскольку сам султан не был способен править, большую часть его обязанностей возложили на его мать. '
          'О действиях самого Мустафы в период его правления известно мало. '
          '26 февраля 1618 года с согласия матери султана Мустафа был свергнут '
          'и заточён во внутренних покоях дворца, '
          'где оставался на протяжении недолгого правления его племянника Османа II.')

my_list = re.sub(r'[^\w\s]','', string)
my_list = my_list.lower().split()
print(sorted(Counter(my_list).most_common(10), key=lambda x: x[1], reverse=True))

# Задача 3. Создайте словарь со списком вещей для похода в качестве ключа и их массой в качестве значения.
# Определите какие вещи влезут в рюкзак передав его максимальную грузоподъёмность.
# Достаточно вернуть один допустимый вариант.
# *Верните все возможные варианты комплектации рюкзака.

MAX_WEIGHT = 10
my_trip = {'Палатка': 3, 'Посуда': 1, 'Вода': 3, 'Еда': 4, 'Одежда': 2}

possible_goods = []
for item, weight in my_trip.items():
        if weight <= MAX_WEIGHT:
            possible_goods.append(item)
            MAX_WEIGHT -= weight
print(possible_goods)
